test/performance/benchmarks/real-traffic-test/results/preempt-k8s/10_seconds-10_interfering/2026-02-23_23-31-33/vegeta_metrics.txt
=== Real Traffic Test Results ===


== Test Configuration ==

Services: 10
RPS: 50
Duration: 1m0s
Min Latency: 0s
Max Latency: 0s
Min Startup Latency: 0s
Max Startup Latency: 0s
Min Payload Size (bytes): 10000
Max Payload Size (bytes): 10000
Critical Test: true
Sources of Interference: 10
Interfering Namespace: interference
Bucket Node: dessertw3


== Test Results ==

= Aggregated Results =

Requests      [total, rate, throughput]         3000, 50.02, 50.01
Duration      [total, attack, wait]             59.987s, 59.98s, 6.418ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.897ms, 122.452ms, 6.342ms, 10.525ms, 722.229ms, 3.123s, 4.022s
Bytes In      [total, mean]                     29124784, 9708.26
Bytes Out     [total, mean]                     30000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:3000  
Error Set:

= Per-Service Results =

# Service: perftest-0
Criticality Level: 1

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.807s, 59.801s, 6.972ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.15ms, 102.399ms, 6.35ms, 9.806ms, 401.974ms, 2.787s, 3.281s
Bytes In      [total, mean]                     2913155, 9710.52
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-1
Criticality Level: 2

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.8s, 5.821ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.901ms, 149.669ms, 6.273ms, 9.933ms, 1.147s, 3.579s, 3.999s
Bytes In      [total, mean]                     2912839, 9709.46
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-2
Criticality Level: 3

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.807s, 59.801s, 6.282ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.897ms, 122.403ms, 6.156ms, 10.405ms, 736.631ms, 3.135s, 3.627s
Bytes In      [total, mean]                     2914164, 9713.88
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-3
Criticality Level: 4

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.807s, 59.799s, 7.556ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.096ms, 151.173ms, 6.436ms, 11.776ms, 1.174s, 3.557s, 4.022s
Bytes In      [total, mean]                     2913646, 9712.15
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-4
Criticality Level: 5

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.807s, 59.8s, 6.168ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.152ms, 100.591ms, 6.357ms, 10.502ms, 358.71ms, 2.766s, 3.24s
Bytes In      [total, mean]                     2912035, 9706.78
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-5
Criticality Level: 6

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.805s, 59.799s, 5.319ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.083ms, 123.867ms, 6.208ms, 9.722ms, 757.35ms, 3.158s, 3.63s
Bytes In      [total, mean]                     2912080, 9706.93
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-6
Criticality Level: 7

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.8s, 5.627ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.177ms, 137.846ms, 6.509ms, 11.664ms, 971.548ms, 3.364s, 3.836s
Bytes In      [total, mean]                     2912311, 9707.70
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-7
Criticality Level: 8

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.8s, 6.296ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.998ms, 102.222ms, 6.482ms, 10.535ms, 398.555ms, 2.783s, 3.275s
Bytes In      [total, mean]                     2910347, 9701.16
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-8
Criticality Level: 9

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.805s, 59.799s, 6.031ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.953ms, 125.623ms, 6.143ms, 9.584ms, 795.647ms, 3.201s, 3.667s
Bytes In      [total, mean]                     2912318, 9707.73
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-9
Criticality Level: 10

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.8s, 6.418ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.19ms, 108.729ms, 6.455ms, 10.728ms, 506.3ms, 2.903s, 3.381s
Bytes In      [total, mean]                     2911889, 9706.30
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set: